[
  {
    "title": "Software Engineer, Web",
    "company": "Calm",
    "description": "About Calm\n\nCalm is on a mission to support everyone on every step of their mental health journey. With the #1 app for sleep, meditation and relaxation as well as a growing library of digital, evidence-based mental health programs, Calm offers trusted support for individuals and organizations alike. Our flagship consumer app provides personalized content and activities – featuring a range of experts and beloved celebrity voices – to help users manage stress, improve sleep and live mindfully. Our workplace and healthcare solutions offer a consumer-friendly approach to clinical content and HIPAA-compliant resources in order to drive positive health and business outcomes. Named a TIME100 Most Influential Company, Calm supports more than 150 million people and 3,500 organizations across seven languages and 190 countries.\n\nWe are hiring remote workers for this role in the San Francisco Bay Area, Los Angeles, New York City, or Minneapolis areas. At this time, only candidates in these locations will be considered.\n\nWhat You’ll Do\n\nThe Software Engineer is a critical member of the Calm Engineering Team. In this role, you will be responsible for designing, developing, and maintaining the frontend systems that power our web applications. You will work closely with a team of engineers, designers, product managers, and customers to ensure that our products are reliable, performant, and secure. Specifically, you will:\n\n• Collaborate with stakeholders to gather requirements, define project scope, and develop technical specifications\n• Design, develop, and maintain frontend systems that are reliable, scalable, and secure for feature completeness\n• Lead development and implementation of complex frontend features and services, collaborating cross-functionally with client engineers to ensure smooth development and deployment process\n• Write high-quality, well-documented, and easily maintainable code that adheres to industry standard best practices\n• Ensure high test coverage for all code, including unit and integration tests\n• Implement frontend features with instrumentation and monitoring to detect system errors and performance issues\n• Stay up-to-date on the latest frontend technologies and trends\n• Develop, mentor and train software engineers\n\nWho You Are\n\n• Experience with the following languages/technologies/frameworks (or equivalents):\n\n• Javascript/Typescript\n• React / NextJS\n• Amplitude \n• DataDog\n• Github\n• Cypress\n• Material UI\n• Docker\n• AWS / GCP\n• Relational DBs / SQL\n• Experience with REST API-based microservices design\n• Experience building responsive web apps with accessibility guidelines \n• Proficiency in writing unit and integration tests in a CI/CD environment\n• Proven experience working effectively in a fast-paced, agile environment as part of a collaborative team\n• Willingness and enthusiasm to learn new technologies and tackle challenging problems\n• Experience providing accurate high-level estimates based on complexity and consistently delivering on time and with quality\n• Consistently deliver on commitments through disciplined estimates and task breakdowns\n• Excellent communication skills, with the ability to convey technical solutions to both technical and non-technical stakeholders\n• Provide high-quality code reviews centered on code quality and mentoring\n• Ability to partner with leads across products to leverage institutional knowledge to solve complex problems\n• Ability to work independently and as part of a team\n• Ability to meet deadlines and work under pressure\n\nNice to Haves\n\n• Past experience building web apps in highly controlled industries, i.e., healthcare\n\nMinimum Requirements\n\n• This role typically requires 3+ years of related experience\n\nCalm uses a geographic pay model that determines salaries based on the location where an employee lives. For this position, the base pay range across Calm’s pay tiers is as follows: $147,000 - $225,000. The base pay range represents the low and high end of Calm’s salary range for this position. Not all candidates will be eligible for the upper end of the salary range. Exact salary will ultimately depend on multiple factors, which include the successful candidate's geographic location, skills, experience and other qualifications. Calm uses employee zip code to determine which pay range applies. This role is also eligible for equity + comprehensive benefits + 401k + flexible time off.\n\nPlease note that Calm may leverage artificial intelligence technology in the application review process.\n\nCalm is committed to providing reasonable accommodations for qualified individuals with disabilities, including disabled veterans. If you require a reasonable accommodation to complete any part of the application or interview process, please contact Calm’s Recruiting team at recruitingaccommodations@calm.com. All accommodation requests will be handled confidentially and assessed on a case-by-case basis.\n\nWe believe that mental health is health, and every person should be considered in the discussion. That’s why we’re proud to be an equal opportunity workplace, committed to providing equal employment opportunities to all applicants and employees regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, medical condition, genetic information, military or veteran status, gender identity or expression, sexual orientation, or any other characteristic protected by applicable federal, state or local law.\n\nCalm is deeply committed to diversity, equity and inclusion. We strive to create a mindful and respectful environment where everyone can bring their authentic self to work, and experience a culture that is free of harassment, racism, and discrimination.\n\nEmployment offers are contingent upon the successful completion of a background check. Roles which require access to certain types of information may also require the successful completion of a drug screening.\n\nFOR US BASED POSITIONS: Calm participates in e-verify. E-verify provides the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.\n\n• Right to Work\n• E-Verify Participation",
    "location": "San Francisco, CA",
    "date_posted": "2025-04-10"
  },
  {
    "title": "Software Engineer, AI Platform - New Grad",
    "company": "Nuro",
    "description": "Who We Are\n\nNuro exists to better everyday life through robotics. Founded in 2016, Nuro has spent eight years developing autonomous driving (AD) technology and commercializing AD applications. The Nuro Driver™ is our world-class autonomous driving system that combines AD hardware with our generalized AI-first self-driving software. Built to learn and improve through data, the Nuro Driver™ is one of the few driverless autonomous technologies on public roads today.\n\nNuro has raised over $2B in capital from Fidelity, Bailie Gifford, T. Rowe Price, Google, and other leading investors. We’ve partnered with some of the world’s most respected brands including Uber, FedEx, Domino’s, Walmart, Kroger, and 7-Eleven.\n\nAbout The Role\n\nOur software team is growing, and we are looking for talented engineers who are graduating by July 2025 to join us and be instrumental to one of the following areas: Data Platform, Onboard Systems, ML Infrastructure, Simulation, or Technical Infrastructure teams.\n\nAbout The Work\n\nDepending on your skill set and areas of interest you will work on some or all of the following:\n\n• Data Platform: The Data Platform serves as a comprehensive management system for Nuro AI Driver's data, labels, and metrics, facilitating seamless access functionality. The team focuses on data annotation across various domains, including 2D/3D perception, mapping, behavior trajectory, and language/text. It also handles data ingestion and mining, employing methods such as heuristics and embedding search. Additionally, the platform supports the autonomy evaluation infrastructure by providing detailed introspection. \n• Onboard Systems: Our onboard system team’s software engineers provide a reliable and high-performance platform that allows our autonomy teams to integrate their autonomy software and algorithms that work across various self-driving platforms. This work requires close collaboration with our software teams, hardware teams, and systems/safety team to make sure new software and hardware work together safely and reliably and resolve onboard error and performance problems.\n• Technical Infrastructure: this group owns few fundamental services for entire engineering organizations: generic compute platform to host mission-critical workflows such as data processing and simulation, storage management service which manages hundreds of PB of data, cloud infrastructure serves as IaaC which provisions and maintains all cloud resources, engineering productivity provides tools such as build and CI/CD to make engineering work more efficient.\n\nAbout You\n\nYou have deep expertise and prior experience in some or many of the following areas:\n\n• You are a current Bachelor’s Degree or Master’s Degree candidate in Computer Science, Electrical Engineering, Robotics, or related field, graduating before July 2025. \n• You have experience in one or more of the following areas: large-scale distributed systems; data storage and processing systems; advanced algorithms using C++ and Python; machine learning, multithreading; x86 architecture; and software performance tuning and optimization, robotics software frameworks, different compute modalities (CPU, GPU, FPGA) etc.\n• You have strong problem-solving and programming skills.\n\nAt Nuro, your base pay is one part of your total compensation package. For this position, the reasonably expected base pay range is between $145,000 and $170,000 for the level at which this job has been scoped. Your base pay will depend on several factors, including your experience, qualifications, education, location, and skills. In the event that you are considered for a different level, a higher or lower pay range would apply. This position is also eligible for an annual performance bonus, equity, and a competitive benefits package\n\nAt Nuro, we celebrate differences and are committed to a diverse workplace that fosters inclusion and psychological safety for all employees. Nuro is proud to be an equal opportunity employer and expressly prohibits any form of workplace discrimination based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, veteran status, or any other legally protected characteristics.",
    "location": "Mountain View, CA",
    "date_posted": "2025-04-16"
  },
  {
    "title": "Intern, Software Engineer",
    "company": "Ticketmaster",
    "description": "Job Summary\n\nJOB DESCRIPTION – Intern, Software Engineer\n\nLocation: Arizona\n\nDivision: Ticketmaster\n\nLine Manager: Director, Software Engineering\n\nTHE TEAM\n\nAt Ticketmaster, we are the team that is responsible for our discovery experience by maximizing revenue for both Ticketmaster and its clients, providing high volume, low latency systems and feature-rich, highly reliable fan facing\n\nexperience. Being part of this team, the successful candidate will be an integral member of the system that supports millions of fans and clients every day. A career at Ticketmaster will challenge and engage you. The pace here is fast, the atmosphere is fun and a passion for live events is a common thread that ties us together. As a global and growing business, we can truly offer a world of\n\nopportunities to expand your skills and develop your career. Visit any of our offices and you'll find a diverse mix of passionate employees, helping fans around the globe connect with the artists, teams, and events they love. It truly is a unique and rewarding environment.\n\nTHE JOB\n\nWe are looking for a Software Engineer Intern who is independent, fast-learning, self-starter, good communication, desire to learn, and interested in code quality. The role will be responsible for translating business objectives into technical solutions and there by building, delivering and maintaining the products.\n\nThe role will be challenged to envision the technical aspects and solutions for the future landscape of globalizing the products. This role is a great opportunity to grow your technical skills and deliver highly impactful products that help millions of fans to experience live events.\n\nWhat You Will Be Doing\n\n• Connect with a series of stakeholders to gather as much information as possible regarding the problem at hand and work together with other engineers to solve it based on the architectures and best practices.\n• Meaningful participation in application and service layer architecture design\n• Objectively explore multiple approaches and recommend the best technical direction and sizing including logic and reasoning.\n• Focus on building software, keeping in mind the main principles of performance, flexibility, and platform scalability.\n• Focus on accessibility to ensure the site is inclusive of all our fans.\n• Ensure code is reliable, maintainable, and fully tested.\n• Maintain and adopt code standards, patterns and best practices through pairing and code reviews.\n• Refactor code when needed.\n• Debug and triage production application issues, often not your own.\n• Monitor logs and identify issues.\n• Ability to organize, prioritize, and multitask.\n• Project management and process analysis could be a heavy focus in this experience\n\nWHAT YOU NEED TO KNOW (or TECHNICAL SKILLS)\n\n• Experience in front end development using React.js and Next.js should be listed as well probably first\n• Experience in backend development, building microservices and RESTful APIs, using Java, ElasticSearch / OpenSearch, K8S / Docker / AWS / CICD\n• Experience with testing frameworks like Jest, Cucumber and Junit\n• Experience in cloud services (e.g. AWS)\n\nLIFE AT TICKETMASTER\n\nWe are proud to be a part of Live Nation Entertainment, the world’s largest live entertainment company.\n\nOur vision at Ticketmaster is to connect people around the world to the live events they love. As the world’s largest ticket marketplace and the leading global provider of enterprise tools and services for the live entertainment business, we are uniquely positioned to successfully deliver on that vision.\n\nWe do it all with an intense passion for Live and an inspiring and diverse culture driven by accessible leaders, attentive managers, and enthusiastic teams. If you’re passionate about live entertainment like we are, and you want to work at a company dedicated to helping millions of fans experience it, we want to hear from you.\n\nOur Work Is Guided By Our Values\n\nReliability - We understand that fans and clients rely on us to power their live event experiences, and we rely on each other to make it happen.\n\nTeamwork - We believe individual achievement pales in comparison to the level of success that can be achieved by a team\n\nIntegrity - We are committed to the highest moral and ethical standards on behalf of the countless partners and stakeholders we represent\n\nBelonging - We are committed to building a culture in which all people can be their authentic selves, have an equal voice and opportunities to thrive\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nWe are passionate and committed to our people and go beyond the rhetoric of diversity and inclusion. You will be working in an inclusive environment and be encouraged to bring your whole self to work. We will do all that we can to help you successfully balance your work and homelife. As a growing business we will encourage you to develop your professional and personal aspirations, enjoy new experiences, and learn from the talented people you will be working with. It’s talent that matters to us and we encourage applications from people irrespective of their gender, race, sexual orientation, religion, age, disability status or caring responsibilities.\n\nTicketmaster strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.\n\nWe will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, San Francisco Fair Chance Ordinance and the California Fair Chance Act and consistent with other similar and / or applicable laws in other areas.\n\nWe also afford equal employment opportunities to qualified individuals with a disability. For this reason, Ticketmaster will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant consistent with its legal obligations to do so, including reasonable accommodations related to pregnancy in accordance with applicable local, state and / or federal law. As part of its commitment to make reasonable accommodations, Ticketmaster also wishes to participate in a timely, good faith, interactive process with a disabled applicant to determine effective reasonable accommodations, if any, which can be made in response to a request for accommodations. Applicants are invited to identify reasonable accommodations that can be made to assist them to perform the essential functions of the position they seek. Any applicant who requires an accommodation in order to perform the essential functions of the job should contact a Human Resources Representative to request the opportunity to participate in a timely interactive process. Ticketmaster will also provide reasonable religious accommodations on a case-by-case basis.\n\nHIRING PRACTICES\n\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\nTicketmaster recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Ticketmaster may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms.",
    "location": "Greater Tucson Area",
    "date_posted": "2025-03-29"
  },
  {
    "title": "Software Engineer 4 - TV & Web Player Platform",
    "company": "Netflix",
    "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe TV &amp; Web Player Platform team is responsible for developing streaming video players that deliver industry-leading playback experiences within the Netflix app on consumer electronic devices and web browsers. Our players operate on millions of devices, including Smart TVs, streaming sticks, game consoles, set-top boxes, and browsers like Chrome, Firefox, and Edge. We aim to delight our members with innovative playback features and exceptional streaming quality.\n\nThe Team\n\nThe TV &amp; Web Player Platform team is at the forefront of testing a diverse set of innovative activities related to product feature expansion. This includes creating tests for recent playback features such as Live Streaming, Seamless Ads playback, and Ident innovation. We conduct A/B tests to thoroughly evaluate features and ensure they perform optimally without regressions. We are deeply involved in continuous integration and release management testing of our video player, which is core to our operations. This critical function ensures the delivery of the best streaming experience to our members by maintaining high standards of quality and performance. Our team collaborates with various cross-functional teams across Netflix, including UI, Encoding, Streaming Algorithms, Security, and Open Connect, to support product development and experimentation through rigorous testing.\n\nOur team consists of engineers from diverse backgrounds, bringing expertise across multiple disciplines, including embedded systems, streaming media playback, content protection, client-server communication, networking protocols, continuous integration, test automation, experimentation, and software engineering. Our success is driven by self-motivated, collaborative, and curious engineers who prioritize the team's goals.\n\nThe Role\n\nWe are seeking a software engineer with a strong focus on test development and automation to join our team. Your primary responsibility will be to improve our video player by developing and automating tests to ensure high-quality streaming experiences on both TV and Web devices. In addition to test development, you will collaborate directly with browser vendors to test and validate browsers using the Netflix player and its features, ensuring a seamless user experience.\n\nWhat sets you apart?\n\n• Passionate about writing and designing tests, recognizing their crucial role in software development.\n• Enthusiastic about collaborating with external partners to troubleshoot and resolve quality issues effectively.\n• Curious and self-motivated, with a willingness to learn, execute, and delve into problems to identify root causes.\n• You seek alternate perspectives to improve your ideas.\n• You can rethink existing designs and rebuild as needed.\n• You use data and seek input from others to inform your decisions. \n• You are selfless, highly collaborative, and willing to help colleagues when in need. \n\nWhat skills are essential to us?\n\n• Have 3+ years of experience in test development and software development.\n• Excellent communication skills for effective collaboration with cross-functional teams and external partners.\n• Proficiency in JavaScript and Node.js\n• Strong analytical and problem-solving skills.\n• Experience with A/B testing, developing experiments to test hypotheses, and analyzing data to drive improvements in streaming quality is nice to have.\n• Solid understanding of Streaming media playback or Video players is nice to have.\n\nOur culture\n\nRead about the Netflix culture which values freedom and responsibility, enabling us to do our best work.\n\nAt Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job, skills, and experience to get it right. These considerations can cause your compensation to vary and will also be dependent on your location.\n\nThe overall market range for roles in this area of Netflix is typically $100,000 - $720,000.\n\nThis market range is based on total compensation (vs. only base salary), which is in line with our compensation philosophy. Netflix is a unique culture and environment. Learn more here.\n\nInclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.\n\nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.\n\nJob is open for no less than 7 days and will be removed when the position is filled.",
    "location": "United States",
    "date_posted": "2025-04-04"
  },
  {
    "title": "Intern, Software Engineer",
    "company": "Ticketmaster",
    "description": "Job Summary\n\nJOB DESCRIPTION – Software Engineer Intern\n\nLocation: New York, New York\n\nDivision: Ticketmaster\n\nLine Manager: Manager, Engineering\n\nTHE TEAM\n\nAt Ticketmaster, we are the team that is responsible for our discovery experience by maximizing revenue for both Ticketmaster and its clients, providing high volume, low latency systems and feature-rich, highly reliable fan facing experience. Being part of this team, the successful candidate will be an integral member of the system that supports millions of fans and clients every day.\n\nA career at Ticketmaster will challenge and engage you. The pace here is fast, the atmosphere is fun and a passion for live events is a common thread that ties us together. As a global and growing business, we can truly offer a world of opportunities to expand your skills and develop your career. Visit any of our offices and you'll find a diverse mix of passionate employees, helping fans around the globe connect with the artists, teams, and events they love. It truly is a unique and rewarding environment.\n\nTHE JOB\n\nWe are looking for a Software Engineer Intern who is independent, fast-learning, self-starter, good communication, desire to learn, and interested in code quality. The role will be responsible for translating business objectives into technical solutions and there by building, delivering and maintaining the products.\n\nThe role will be challenged to envision the technical aspects and solutions for the future landscape of globalizing the products. This role is a great opportunity to grow your technical skills and deliver highly impactful products that help millions of fans to experience live events.\n\nWhat You Will Be Doing\n\n• Connect with a series of stakeholders to gather as much information as possible regarding the problem at hand and work together with other engineers to solve it based on the architectures and best practices.\n• Meaningful participation in application and service layer architecture design\n• Objectively explore multiple approaches and recommend the best technical direction and sizing including logic and reasoning.\n• Focus on building software, keeping in mind the main principles of performance, flexibility, and platform scalability.\n• Focus on accessibility to ensure the site is inclusive of all our fans.\n• Ensure code is reliable, maintainable, and fully tested.\n• Maintain and adopt code standards, patterns and best practices through pairing and code reviews.\n• Refactor code when needed.\n• Debug and triage production application issues, often not your own.\n• Monitor logs and identify issues.\n• Ability to organize, prioritize, and multitask.\n\nWHAT YOU NEED TO KNOW (or TECHNICAL SKILLS)\n\n• Experience in backend development, building microservices and RESTful APIs, using Java, ElasticSearch / OpenSearch, K8S / Docker / AWS / CICD\n• Experience with testing frameworks like Jest, Cucumber and Junit\n• Experience in cloud services (e.g. AWS)\n• Experience with VCL (Fastly), Terraform and/or Kubernetes is a plus\n• Frontend development experience, including experience in implementing and maintaining software using CSS/SCSS, Javascript, React.js, Node.js and Redux\n• Understand the importance of accessibility, ensure it is considered from the start of the development process and be able to use tools to audit and fix accessibility issues\n• Experience in Agile development methodologies\n• Strong in troubleshooting, debugging, fixing issues, and finding possibilities to automate routine tasks.\n\nYou (behavioural Skills)\n\n• Can work autonomously and proactively, with minimal supervision\n• Focus on results and desired outcomes and how best to achieve them\n• Can consider multiple approaches and recommends the best technical direction including logic and reasoning\n• Can solve complex technical issues through debugging, research, and investigation\n• Promote cooperation and commitment within a team to achieve goals and deliverables\n• Maintain and fosters relationships within, across, and external to organizational boundaries\n• Passionate about technology, software development and transformation\n• Desire to continually improve your own skills, and ability to transfer that to the skills of others\n\nLIFE AT TICKETMASTER\n\nWe are proud to be a part of Live Nation Entertainment, the world’s largest live entertainment company.\n\nOur vision at Ticketmaster is to connect people around the world to the live events they love. As the world’s largest ticket marketplace and the leading global provider of enterprise tools and services for the live entertainment business, we are uniquely positioned to successfully deliver on that vision.\n\nWe do it all with an intense passion for Live and an inspiring and diverse culture driven by accessible leaders, attentive managers, and enthusiastic teams. If you’re passionate about live entertainment like we are, and you want to work at a company dedicated to helping millions of fans experience it, we want to hear from you.\n\nOur Work Is Guided By Our Values\n\nReliability - We understand that fans and clients rely on us to power their live event experiences, and we rely on each other to make it happen.\n\nTeamwork - We believe individual achievement pales in comparison to the level of success that can be achieved by a team\n\nIntegrity - We are committed to the highest moral and ethical standards on behalf of the countless partners and stakeholders we represent\n\nBelonging - We are committed to building a culture in which all people can be their authentic selves, have an equal voice and opportunities to thrive\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nWe are passionate and committed to our people and go beyond the rhetoric of diversity and inclusion. You will be working in an inclusive environment and be encouraged to bring your whole self to work. We will do all that we can to help you successfully balance your work and homelife. As a growing business we will encourage you to develop your professional and personal aspirations, enjoy new experiences, and learn from the talented people you will be working with. It’s talent that matters to us and we encourage applications from people irrespective of their gender, race, sexual orientation, religion, age, disability status or caring responsibilities.\n\nTicketmaster strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.\n\nWe will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, San Francisco Fair Chance Ordinance and the California Fair Chance Act and consistent with other similar and / or applicable laws in other areas.\n\nWe also afford equal employment opportunities to qualified individuals with a disability. For this reason, Ticketmaster will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant consistent with its legal obligations to do so, including reasonable accommodations related to pregnancy in accordance with applicable local, state and / or federal law. As part of its commitment to make reasonable accommodations, Ticketmaster also wishes to participate in a timely, good faith, interactive process with a disabled applicant to determine effective reasonable accommodations, if any, which can be made in response to a request for accommodations. Applicants are invited to identify reasonable accommodations that can be made to assist them to perform the essential functions of the position they seek. Any applicant who requires an accommodation in order to perform the essential functions of the job should contact a Human Resources Representative to request the opportunity to participate in a timely interactive process. Ticketmaster will also provide reasonable religious accommodations on a case-by-case basis.\n\nHIRING PRACTICES\n\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n\nTicketmaster recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Ticketmaster may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms.\n\nThe Expected Compensation For This Position Is\n\n$20.00 USD - $25.00 USD Hourly\n\n• Pay is based on a number of factors including market location, qualifications, skills, and experience.",
    "location": "New York, NY",
    "date_posted": "Recently posted"
  }
]